Revit 2026 API

# IFCDataAsLogical Method

---

Gets storage value as IFCLogical when its PrimitiveType is logical.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCLogical AsLogical()
```
```vb
Public Function AsLogical As IFCLogical
```
```cpp
public:
IFCLogical AsLogical()
```
```fsharp
member AsLogical : unit -> IFCLogical
```

#### Return Value

IFCLogical The IFCLogical value.

| Exception | Condition |
| --- | --- |
| InapplicableDataException | The primitive type is not logical. |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace